stages = {
    0: """
    +---+
    |   |
        |
        |
        |
        |
==============
""",
    1: """
    +---+
    |   |
    O   |
        |
        |
        |
==============
""",
    2: """
    +---+
    |   |
    O   |
    |   |
        |
        |
==============
""",
    3: """
    +---+
    |   |
    O   |
   /|   |
        |
        |
==============
""",
    4: """
    +---+
    |   |
    O   |
   /|\  |
        |
        |
==============
""",
    5: """
    +---+
    |   |
    O   |
   /|\  |
   /    |
        |
==============
""",
    6: """
    +---+
    |   |
    O   |
   /|\  |
   / \  |
        |
==============
"""
}

words = [
    "яблоко", "собака", "кошка", "дом", "машина", "цветок", "дерево", "птица", "книга", "ручка",
    "река", "гора", "солнце", "луна", "звезда", "океан", "рыба", "компьютер", "телефон", "стул",
    "стол", "дверь", "окно", "ключ", "корабль", "остров", "гитара", "пианино", "шляпа", "туфли",
    "носки", "мяч", "торт", "молоко", "хлеб", "масло", "кофе", "чай", "сок", "пицца",
    "бургер", "бутерброд", "салат", "ложка", "вилка", "нож", "тарелка", "стакан", "зеркало", "рубашка",
    "брюки", "платье", "юбка", "носки", "туфли", "шапка", "шарф", "перчатки", "пальто", "куртка",
    "сумка", "кошелек", "часы", "браслет", "кольцо", "серьги", "ожерелье", "ремень", "галстук", "зонт",
    "восход", "закат", "дождь", "снег", "ветер", "гроза", "молния", "облако", "радуга", "шторм",
    "огонь", "земля", "воздух", "вода", "цветок", "бабочка", "пчела", "муравей", "паук", "улитка",
    "кролик", "лиса", "олень", "лев", "тигр", "слон", "медведь", "пингвин", "дельфин", "кит"
]

alpha = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
